apache/nuttx/arch/arm/src/common/stm32/stm32_capture_m3m4_v1.c
  switch (priv->base)
    {
#ifdef CONFIG_STM32_TIM1
      case STM32_TIM1_BASE:
        freqin = STM32_TIM1_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM2
      case STM32_TIM2_BASE:
        freqin = STM32_TIM2_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM3
      case STM32_TIM3_BASE:
        freqin = STM32_TIM3_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM4
      case STM32_TIM4_BASE:
        freqin = STM32_TIM4_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM5
      case STM32_TIM5_BASE:
        freqin = STM32_TIM5_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM8
      case STM32_TIM8_BASE:
        freqin = STM32_TIM8_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM9
      case STM32_TIM9_BASE:
        freqin = STM32_TIM9_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM10
      case STM32_TIM10_BASE:
        freqin = STM32_TIM10_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM11
      case STM32_TIM11_BASE:
        freqin = STM32_TIM11_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM12
      case STM32_TIM12_BASE:
        freqin = STM32_TIM12_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM13
      case STM32_TIM13_BASE:
        freqin = STM32_TIM13_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM14
      case STM32_TIM14_BASE:
        freqin = STM32_TIM14_CLKIN;
        break;
#endif

      default:
        return -EINVAL;
    }

  /* Select a pre-scaler value for this timer using the input clock
   * frequency.
   */

  prescaler = freqin / freq;

  /* We need to decrement value for '1', but only, if we are allowed to
   * not to cause underflow. Check for overflow.
   */

  if (prescaler > 0)
    {
      prescaler--;
    }

  if (prescaler > 0xffff)
    {
      prescaler = 0xffff;
    }

  /* Set Maximum */

  stm32_putreg32(priv, STM32_BTIM_ARR_OFFSET, max);

  /* Set prescaler */

  stm32_putreg16(priv, STM32_BTIM_PSC_OFFSET, prescaler);

  /* Reset counter timer */

  stm32_modifyreg16(priv, STM32_BTIM_EGR_OFFSET, 0, BTIM_EGR_UG);

  /* Enable timer */

  stm32_modifyreg16(priv, STM32_BTIM_CR1_OFFSET, 0, BTIM_CR1_CEN);

#ifdef USE_ADVENCED_TIM
  /* Advanced registers require Main Output Enable */

  if (priv->base == STM32_TIM1_BASE || priv->base == STM32_TIM8_BASE)
    {
      stm32_modifyreg16(priv, STM32_ATIM_BDTR_OFFSET, 0, ATIM_BDTR_MOE);
    }
#endif

  return prescaler;
}

/****************************************************************************
 * Name: stm32_cap_setsmc
 *
 * Description:
 *   set slave mode control register
 *
 * Input Parameters:
 *   dev - A pointer of the stm32 capture device structure.
 *   cfg - Slave mode control register configure of timer.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int stm32_cap_setsmc(struct stm32_cap_dev_s *dev,
                            stm32_cap_smc_cfg_t cfg)
{
  const struct stm32_cap_priv_s *priv = (const struct stm32_cap_priv_s *)dev;
  uint16_t regval = 0;
  uint16_t mask = 0;

  switch (cfg & STM32_CAP_SMS_MASK)
    {
      case STM32_CAP_SMS_INT:
          regval |= GTIM_SMCR_DISAB;
          break;

      case STM32_CAP_SMS_ENC1:
          regval |= GTIM_SMCR_ENCMD1;
          break;

      case STM32_CAP_SMS_ENC2:
          regval |= GTIM_SMCR_ENCMD2;
          break;

      case STM32_CAP_SMS_ENC3:
          regval |= GTIM_SMCR_ENCMD3;
          break;

      case STM32_CAP_SMS_RST:
          regval |= GTIM_SMCR_RESET;
          break;

      case STM32_CAP_SMS_GAT:
          regval |= GTIM_SMCR_GATED;
          break;

      case STM32_CAP_SMS_TRG:
          regval |= GTIM_SMCR_TRIGGER;
          break;

      case STM32_CAP_SMS_EXT:
          regval |= GTIM_SMCR_EXTCLK1;
          break;

      default:
          break;
    }

  switch (cfg & STM32_CAP_TS_MASK)
    {
      case STM32_CAP_TS_ITR0:
          regval |= GTIM_SMCR_ITR0;
          break;

      case STM32_CAP_TS_ITR1:
          regval |= GTIM_SMCR_ITR1;
          break;

      case STM32_CAP_TS_ITR2:
          regval |= GTIM_SMCR_ITR2;
          break;

      case STM32_CAP_TS_ITR3:
          regval |= GTIM_SMCR_ITR3;
          break;

      case STM32_CAP_TS_TI1FED:
          regval |= GTIM_SMCR_TI1FED;
          break;

      case STM32_CAP_TS_TI1FP1:
          regval |= GTIM_SMCR_TI1FP1;
          break;

      case STM32_CAP_TS_TI2FP2:
          regval |= GTIM_SMCR_TI2FP2;
          break;

      case STM32_CAP_TS_ETRF:
          regval |= GTIM_SMCR_ETRF;
          break;

      default:
          break;
    }

  if (cfg & STM32_CAP_MSM_MASK)
    {
      regval |= STM32_CAP_MSM_MASK;
    }

  mask = (STM32_CAP_SMS_MASK | STM32_CAP_TS_MASK | STM32_CAP_MSM_MASK);
  stm32_modifyreg16(priv, STM32_GTIM_SMCR_OFFSET, mask, regval);

  return OK;
}

static int stm32_cap_setisr(struct stm32_cap_dev_s *dev, xcpt_t handler,
                            void *arg)
{
  const struct stm32_cap_priv_s *priv = (const struct stm32_cap_priv_s *)dev;
  int irq;
#ifdef USE_ADVENCED_TIM
  int irq_of;
#endif

  DEBUGASSERT(dev != NULL);

  irq = priv->irq;
#ifdef USE_ADVENCED_TIM
  irq_of = priv->irq_of;
#endif

  /* Disable interrupt when callback is removed */

  if (!handler)
    {
      up_disable_irq(irq);
      irq_detach(irq);

#ifdef USE_ADVENCED_TIM
      if (priv->irq_of)
        {
          up_disable_irq(irq_of);
          irq_detach(irq_of);
        }
#endif

      return OK;
    }

  /* Otherwise set callback and enable interrupt */

  irq_attach(irq, handler, arg);
  up_enable_irq(irq);

#ifdef USE_ADVENCED_TIM
  if (priv->irq_of)
    {
      irq_attach(priv->irq_of, handler, arg);
      up_enable_irq(priv->irq_of);
    }
#endif

  return OK;
}

static void stm32_cap_enableint(struct stm32_cap_dev_s *dev,
                                stm32_cap_flags_t src, bool on)
{
  const struct stm32_cap_priv_s *priv = (const struct stm32_cap_priv_s *)dev;
  uint16_t mask = 0;

  DEBUGASSERT(dev != NULL);

